2020-10-03 19:53:29,136: <INFO> Training autoencoder v2: attempt 0
2020-10-03 19:53:29,137: <INFO> Model: "autoencoder-v2"
2020-10-03 19:53:29,138: <INFO> _________________________________________________________________
2020-10-03 19:53:29,139: <INFO> Layer (type)                 Output Shape              Param #   
2020-10-03 19:53:29,139: <INFO> =================================================================
2020-10-03 19:53:29,142: <INFO> conv1 (Conv2D)               (None, 32, 32, 4)         52        
2020-10-03 19:53:29,142: <INFO> _________________________________________________________________
2020-10-03 19:53:29,145: <INFO> conv2 (Conv2D)               (None, 16, 16, 13)        221       
2020-10-03 19:53:29,145: <INFO> _________________________________________________________________
2020-10-03 19:53:29,146: <INFO> deconv2 (Conv2DTranspose)    (None, 32, 32, 4)         212       
2020-10-03 19:53:29,147: <INFO> _________________________________________________________________
2020-10-03 19:53:29,148: <INFO> deconv1 (Conv2DTranspose)    (None, 64, 64, 3)         51        
2020-10-03 19:53:29,149: <INFO> =================================================================
2020-10-03 19:53:29,151: <INFO> Total params: 536
2020-10-03 19:53:29,151: <INFO> Trainable params: 433
2020-10-03 19:53:29,151: <INFO> Non-trainable params: 103
2020-10-03 19:53:29,152: <INFO> _________________________________________________________________
2020-10-03 19:53:32,318: <INFO> Epoch 0, loss 0.040588, change 0.040588
2020-10-03 19:53:43,036: <INFO> Epoch 50, loss 0.005768, change 0.034820
2020-10-03 19:53:53,491: <INFO> Epoch 100, loss 0.005693, change 0.000075
2020-10-03 19:54:03,972: <INFO> Epoch 150, loss 0.000303, change 0.005390
2020-10-03 19:54:14,305: <INFO> Epoch 200, loss 0.000201, change 0.000102
2020-10-03 19:54:24,721: <INFO> Epoch 250, loss 0.000146, change 0.000055
2020-10-03 19:54:35,205: <INFO> Epoch 300, loss 0.000113, change 0.000033
2020-10-03 19:54:45,803: <INFO> Epoch 350, loss 0.000101, change 0.000013
2020-10-03 19:54:56,143: <INFO> Epoch 400, loss 0.000095, change 0.000005
2020-10-03 19:55:06,477: <INFO> Training autoencoder v2: attempt 1
2020-10-03 19:55:06,478: <INFO> Model: "autoencoder-v2"
2020-10-03 19:55:06,478: <INFO> _________________________________________________________________
2020-10-03 19:55:06,479: <INFO> Layer (type)                 Output Shape              Param #   
2020-10-03 19:55:06,480: <INFO> =================================================================
2020-10-03 19:55:06,481: <INFO> conv1 (Conv2D)               (None, 32, 32, 4)         52        
2020-10-03 19:55:06,481: <INFO> _________________________________________________________________
2020-10-03 19:55:06,483: <INFO> conv2 (Conv2D)               (None, 16, 16, 13)        221       
2020-10-03 19:55:06,483: <INFO> _________________________________________________________________
2020-10-03 19:55:06,484: <INFO> deconv2 (Conv2DTranspose)    (None, 32, 32, 4)         212       
2020-10-03 19:55:06,485: <INFO> _________________________________________________________________
2020-10-03 19:55:06,486: <INFO> deconv1 (Conv2DTranspose)    (None, 64, 64, 3)         51        
2020-10-03 19:55:06,486: <INFO> =================================================================
2020-10-03 19:55:06,488: <INFO> Total params: 536
2020-10-03 19:55:06,489: <INFO> Trainable params: 433
2020-10-03 19:55:06,489: <INFO> Non-trainable params: 103
2020-10-03 19:55:06,490: <INFO> _________________________________________________________________
2020-10-03 19:55:07,462: <INFO> Epoch 0, loss 0.069686, change 0.069686
2020-10-03 19:55:17,964: <INFO> Epoch 50, loss 0.012753, change 0.056933
2020-10-03 19:55:28,564: <INFO> Epoch 100, loss 0.012550, change 0.000203
2020-10-03 19:55:39,142: <INFO> Epoch 150, loss 0.012476, change 0.000074
2020-10-03 19:55:49,550: <INFO> Epoch 200, loss 0.012417, change 0.000058
2020-10-03 19:56:00,059: <INFO> Epoch 250, loss 0.012361, change 0.000057
2020-10-03 19:56:10,550: <INFO> Epoch 300, loss 0.012335, change 0.000025
2020-10-03 19:56:20,966: <INFO> Epoch 350, loss 0.012322, change 0.000013
2020-10-03 19:56:31,452: <INFO> Epoch 400, loss 0.012316, change 0.000006
2020-10-03 19:56:41,982: <INFO> Epoch 450, loss 0.012315, change 0.000001
2020-10-03 19:56:43,112: <INFO> Training autoencoder v2: attempt 2
2020-10-03 19:56:43,112: <INFO> Model: "autoencoder-v2"
2020-10-03 19:56:43,112: <INFO> _________________________________________________________________
2020-10-03 19:56:43,113: <INFO> Layer (type)                 Output Shape              Param #   
2020-10-03 19:56:43,113: <INFO> =================================================================
2020-10-03 19:56:43,114: <INFO> conv1 (Conv2D)               (None, 32, 32, 4)         52        
2020-10-03 19:56:43,115: <INFO> _________________________________________________________________
2020-10-03 19:56:43,115: <INFO> conv2 (Conv2D)               (None, 16, 16, 13)        221       
2020-10-03 19:56:43,116: <INFO> _________________________________________________________________
2020-10-03 19:56:43,117: <INFO> deconv2 (Conv2DTranspose)    (None, 32, 32, 4)         212       
2020-10-03 19:56:43,117: <INFO> _________________________________________________________________
2020-10-03 19:56:43,118: <INFO> deconv1 (Conv2DTranspose)    (None, 64, 64, 3)         51        
2020-10-03 19:56:43,118: <INFO> =================================================================
2020-10-03 19:56:43,120: <INFO> Total params: 536
2020-10-03 19:56:43,120: <INFO> Trainable params: 433
2020-10-03 19:56:43,120: <INFO> Non-trainable params: 103
2020-10-03 19:56:43,121: <INFO> _________________________________________________________________
2020-10-03 19:56:44,108: <INFO> Epoch 0, loss 0.139852, change 0.139852
2020-10-03 19:56:54,497: <INFO> Epoch 50, loss 0.030363, change 0.109489
2020-10-03 19:57:05,197: <INFO> Epoch 100, loss 0.030185, change 0.000179
2020-10-03 19:57:15,599: <INFO> Epoch 150, loss 0.005707, change 0.024478
2020-10-03 19:57:25,702: <INFO> Epoch 200, loss 0.005611, change 0.000096
2020-10-03 19:57:36,205: <INFO> Epoch 250, loss 0.004169, change 0.001441
2020-10-03 19:57:46,751: <INFO> Epoch 300, loss 0.004153, change 0.000016
2020-10-03 19:57:57,369: <INFO> Epoch 350, loss 0.004145, change 0.000008
2020-10-03 19:58:08,056: <INFO> Epoch 400, loss 0.004137, change 0.000008
2020-10-03 19:58:18,768: <INFO> Epoch 450, loss 0.004132, change 0.000005
2020-10-03 19:58:25,482: <INFO> Training autoencoder v2: attempt 3
2020-10-03 19:58:25,483: <INFO> Model: "autoencoder-v2"
2020-10-03 19:58:25,484: <INFO> _________________________________________________________________
2020-10-03 19:58:25,485: <INFO> Layer (type)                 Output Shape              Param #   
2020-10-03 19:58:25,486: <INFO> =================================================================
2020-10-03 19:58:25,487: <INFO> conv1 (Conv2D)               (None, 32, 32, 4)         52        
2020-10-03 19:58:25,487: <INFO> _________________________________________________________________
2020-10-03 19:58:25,489: <INFO> conv2 (Conv2D)               (None, 16, 16, 13)        221       
2020-10-03 19:58:25,490: <INFO> _________________________________________________________________
2020-10-03 19:58:25,491: <INFO> deconv2 (Conv2DTranspose)    (None, 32, 32, 4)         212       
2020-10-03 19:58:25,491: <INFO> _________________________________________________________________
2020-10-03 19:58:25,492: <INFO> deconv1 (Conv2DTranspose)    (None, 64, 64, 3)         51        
2020-10-03 19:58:25,493: <INFO> =================================================================
2020-10-03 19:58:25,495: <INFO> Total params: 536
2020-10-03 19:58:25,495: <INFO> Trainable params: 433
2020-10-03 19:58:25,495: <INFO> Non-trainable params: 103
2020-10-03 19:58:25,496: <INFO> _________________________________________________________________
2020-10-03 19:58:26,468: <INFO> Epoch 0, loss 0.108096, change 0.108096
2020-10-03 19:58:37,161: <INFO> Epoch 50, loss 0.015610, change 0.092486
2020-10-03 19:58:47,813: <INFO> Epoch 100, loss 0.015474, change 0.000136
2020-10-03 19:58:58,548: <INFO> Epoch 150, loss 0.000223, change 0.015251
2020-10-03 19:59:09,182: <INFO> Epoch 200, loss 0.000150, change 0.000073
2020-10-03 19:59:19,764: <INFO> Epoch 250, loss 0.000107, change 0.000043
2020-10-03 19:59:30,252: <INFO> Epoch 300, loss 0.000090, change 0.000017
2020-10-03 19:59:40,709: <INFO> Epoch 350, loss 0.000085, change 0.000004
2020-10-03 19:59:51,172: <INFO> Epoch 400, loss 0.000076, change 0.000010
2020-10-03 20:00:01,742: <INFO> Epoch 450, loss 0.000072, change 0.000003
2020-10-03 20:00:09,832: <INFO> Training autoencoder v2: attempt 4
2020-10-03 20:00:09,832: <INFO> Model: "autoencoder-v2"
2020-10-03 20:00:09,832: <INFO> _________________________________________________________________
2020-10-03 20:00:09,833: <INFO> Layer (type)                 Output Shape              Param #   
2020-10-03 20:00:09,834: <INFO> =================================================================
2020-10-03 20:00:09,835: <INFO> conv1 (Conv2D)               (None, 32, 32, 4)         52        
2020-10-03 20:00:09,836: <INFO> _________________________________________________________________
2020-10-03 20:00:09,837: <INFO> conv2 (Conv2D)               (None, 16, 16, 13)        221       
2020-10-03 20:00:09,837: <INFO> _________________________________________________________________
2020-10-03 20:00:09,839: <INFO> deconv2 (Conv2DTranspose)    (None, 32, 32, 4)         212       
2020-10-03 20:00:09,839: <INFO> _________________________________________________________________
2020-10-03 20:00:09,841: <INFO> deconv1 (Conv2DTranspose)    (None, 64, 64, 3)         51        
2020-10-03 20:00:09,841: <INFO> =================================================================
2020-10-03 20:00:09,843: <INFO> Total params: 536
2020-10-03 20:00:09,843: <INFO> Trainable params: 433
2020-10-03 20:00:09,844: <INFO> Non-trainable params: 103
2020-10-03 20:00:09,845: <INFO> _________________________________________________________________
2020-10-03 20:00:10,833: <INFO> Epoch 0, loss 0.088450, change 0.088450
2020-10-03 20:00:21,417: <INFO> Epoch 50, loss 0.060986, change 0.027464
2020-10-03 20:00:31,967: <INFO> Epoch 100, loss 0.060840, change 0.000146
2020-10-03 20:00:42,654: <INFO> Epoch 150, loss 0.060798, change 0.000043
2020-10-03 20:00:53,183: <INFO> Epoch 200, loss 0.060766, change 0.000031
2020-10-03 20:01:03,998: <INFO> Epoch 250, loss 0.060745, change 0.000021
2020-10-03 20:01:14,641: <INFO> Epoch 300, loss 0.060736, change 0.000010
2020-10-03 20:01:25,372: <INFO> Epoch 350, loss 0.060732, change 0.000004
2020-10-03 20:01:32,282: <INFO> Training autoencoder v2: attempt 5
2020-10-03 20:01:32,282: <INFO> Model: "autoencoder-v2"
2020-10-03 20:01:32,283: <INFO> _________________________________________________________________
2020-10-03 20:01:32,284: <INFO> Layer (type)                 Output Shape              Param #   
2020-10-03 20:01:32,285: <INFO> =================================================================
2020-10-03 20:01:32,287: <INFO> conv1 (Conv2D)               (None, 32, 32, 4)         52        
2020-10-03 20:01:32,287: <INFO> _________________________________________________________________
2020-10-03 20:01:32,289: <INFO> conv2 (Conv2D)               (None, 16, 16, 13)        221       
2020-10-03 20:01:32,289: <INFO> _________________________________________________________________
2020-10-03 20:01:32,290: <INFO> deconv2 (Conv2DTranspose)    (None, 32, 32, 4)         212       
2020-10-03 20:01:32,291: <INFO> _________________________________________________________________
2020-10-03 20:01:32,292: <INFO> deconv1 (Conv2DTranspose)    (None, 64, 64, 3)         51        
2020-10-03 20:01:32,292: <INFO> =================================================================
2020-10-03 20:01:32,294: <INFO> Total params: 536
2020-10-03 20:01:32,295: <INFO> Trainable params: 433
2020-10-03 20:01:32,295: <INFO> Non-trainable params: 103
2020-10-03 20:01:32,296: <INFO> _________________________________________________________________
2020-10-03 20:01:33,285: <INFO> Epoch 0, loss 0.106890, change 0.106890
2020-10-03 20:01:43,817: <INFO> Epoch 50, loss 0.047364, change 0.059526
2020-10-03 20:01:54,400: <INFO> Epoch 100, loss 0.047228, change 0.000136
2020-10-03 20:02:04,730: <INFO> Epoch 150, loss 0.044713, change 0.002514
2020-10-03 20:02:15,247: <INFO> Epoch 200, loss 0.044656, change 0.000058
2020-10-03 20:02:26,032: <INFO> Epoch 250, loss 0.044607, change 0.000049
2020-10-03 20:02:36,599: <INFO> Epoch 300, loss 0.044564, change 0.000043
2020-10-03 20:02:47,091: <INFO> Epoch 350, loss 0.044546, change 0.000018
2020-10-03 20:02:57,615: <INFO> Epoch 400, loss 0.044536, change 0.000010
2020-10-03 20:03:08,202: <INFO> Epoch 450, loss 0.044528, change 0.000007
2020-10-03 20:03:18,842: <INFO> Epoch 500, loss 0.044527, change 0.000001
2020-10-03 20:03:22,988: <INFO> Training autoencoder v2: attempt 6
2020-10-03 20:03:22,988: <INFO> Model: "autoencoder-v2"
2020-10-03 20:03:22,989: <INFO> _________________________________________________________________
2020-10-03 20:03:22,989: <INFO> Layer (type)                 Output Shape              Param #   
2020-10-03 20:03:22,990: <INFO> =================================================================
2020-10-03 20:03:22,992: <INFO> conv1 (Conv2D)               (None, 32, 32, 4)         52        
2020-10-03 20:03:22,992: <INFO> _________________________________________________________________
2020-10-03 20:03:22,993: <INFO> conv2 (Conv2D)               (None, 16, 16, 13)        221       
2020-10-03 20:03:22,994: <INFO> _________________________________________________________________
2020-10-03 20:03:22,995: <INFO> deconv2 (Conv2DTranspose)    (None, 32, 32, 4)         212       
2020-10-03 20:03:22,995: <INFO> _________________________________________________________________
2020-10-03 20:03:22,997: <INFO> deconv1 (Conv2DTranspose)    (None, 64, 64, 3)         51        
2020-10-03 20:03:22,998: <INFO> =================================================================
2020-10-03 20:03:23,000: <INFO> Total params: 536
2020-10-03 20:03:23,001: <INFO> Trainable params: 433
2020-10-03 20:03:23,003: <INFO> Non-trainable params: 103
2020-10-03 20:03:23,004: <INFO> _________________________________________________________________
2020-10-03 20:03:24,062: <INFO> Epoch 0, loss 0.086474, change 0.086474
2020-10-03 20:03:34,703: <INFO> Epoch 50, loss 0.006193, change 0.080280
2020-10-03 20:03:45,393: <INFO> Epoch 100, loss 0.006023, change 0.000171
2020-10-03 20:03:56,376: <INFO> Epoch 150, loss 0.005949, change 0.000073
2020-10-03 20:04:07,109: <INFO> Epoch 200, loss 0.005898, change 0.000051
2020-10-03 20:04:17,835: <INFO> Epoch 250, loss 0.005868, change 0.000031
2020-10-03 20:04:28,707: <INFO> Epoch 300, loss 0.005846, change 0.000021
2020-10-03 20:04:39,571: <INFO> Epoch 350, loss 0.005832, change 0.000014
2020-10-03 20:04:50,291: <INFO> Epoch 400, loss 0.002983, change 0.002849
2020-10-03 20:05:01,005: <INFO> Epoch 450, loss 0.002978, change 0.000005
2020-10-03 20:05:11,575: <INFO> Epoch 500, loss 0.002973, change 0.000004
2020-10-03 20:05:16,976: <INFO> Training autoencoder v2: attempt 7
2020-10-03 20:05:16,976: <INFO> Model: "autoencoder-v2"
2020-10-03 20:05:16,977: <INFO> _________________________________________________________________
2020-10-03 20:05:16,977: <INFO> Layer (type)                 Output Shape              Param #   
2020-10-03 20:05:16,978: <INFO> =================================================================
2020-10-03 20:05:16,980: <INFO> conv1 (Conv2D)               (None, 32, 32, 4)         52        
2020-10-03 20:05:16,980: <INFO> _________________________________________________________________
2020-10-03 20:05:16,981: <INFO> conv2 (Conv2D)               (None, 16, 16, 13)        221       
2020-10-03 20:05:16,982: <INFO> _________________________________________________________________
2020-10-03 20:05:16,983: <INFO> deconv2 (Conv2DTranspose)    (None, 32, 32, 4)         212       
2020-10-03 20:05:16,999: <INFO> _________________________________________________________________
2020-10-03 20:05:17,002: <INFO> deconv1 (Conv2DTranspose)    (None, 64, 64, 3)         51        
2020-10-03 20:05:17,002: <INFO> =================================================================
2020-10-03 20:05:17,004: <INFO> Total params: 536
2020-10-03 20:05:17,005: <INFO> Trainable params: 433
2020-10-03 20:05:17,005: <INFO> Non-trainable params: 103
2020-10-03 20:05:17,005: <INFO> _________________________________________________________________
2020-10-03 20:05:18,071: <INFO> Epoch 0, loss 0.120431, change 0.120431
2020-10-03 20:05:28,800: <INFO> Epoch 50, loss 0.019831, change 0.100600
2020-10-03 20:05:39,391: <INFO> Epoch 100, loss 0.019706, change 0.000125
2020-10-03 20:05:49,977: <INFO> Epoch 150, loss 0.019515, change 0.000190
2020-10-03 20:06:00,702: <INFO> Epoch 200, loss 0.019477, change 0.000038
2020-10-03 20:06:11,481: <INFO> Epoch 250, loss 0.019455, change 0.000023
2020-10-03 20:06:22,110: <INFO> Epoch 300, loss 0.019437, change 0.000017
2020-10-03 20:06:32,705: <INFO> Epoch 350, loss 0.019428, change 0.000009
2020-10-03 20:06:43,421: <INFO> Epoch 400, loss 0.019424, change 0.000004
2020-10-03 20:06:53,287: <INFO> Training autoencoder v2: attempt 8
2020-10-03 20:06:53,287: <INFO> Model: "autoencoder-v2"
2020-10-03 20:06:53,288: <INFO> _________________________________________________________________
2020-10-03 20:06:53,289: <INFO> Layer (type)                 Output Shape              Param #   
2020-10-03 20:06:53,289: <INFO> =================================================================
2020-10-03 20:06:53,290: <INFO> conv1 (Conv2D)               (None, 32, 32, 4)         52        
2020-10-03 20:06:53,291: <INFO> _________________________________________________________________
2020-10-03 20:06:53,293: <INFO> conv2 (Conv2D)               (None, 16, 16, 13)        221       
2020-10-03 20:06:53,293: <INFO> _________________________________________________________________
2020-10-03 20:06:53,294: <INFO> deconv2 (Conv2DTranspose)    (None, 32, 32, 4)         212       
2020-10-03 20:06:53,294: <INFO> _________________________________________________________________
2020-10-03 20:06:53,297: <INFO> deconv1 (Conv2DTranspose)    (None, 64, 64, 3)         51        
2020-10-03 20:06:53,297: <INFO> =================================================================
2020-10-03 20:06:53,300: <INFO> Total params: 536
2020-10-03 20:06:53,301: <INFO> Trainable params: 433
2020-10-03 20:06:53,302: <INFO> Non-trainable params: 103
2020-10-03 20:06:53,302: <INFO> _________________________________________________________________
2020-10-03 20:06:54,310: <INFO> Epoch 0, loss 0.084636, change 0.084636
2020-10-03 20:07:04,821: <INFO> Epoch 50, loss 0.018478, change 0.066158
2020-10-03 20:07:15,336: <INFO> Epoch 100, loss 0.018371, change 0.000107
2020-10-03 20:07:25,949: <INFO> Epoch 150, loss 0.018303, change 0.000068
2020-10-03 20:07:36,647: <INFO> Epoch 200, loss 0.015422, change 0.002881
2020-10-03 20:07:47,339: <INFO> Epoch 250, loss 0.015389, change 0.000033
2020-10-03 20:07:58,054: <INFO> Epoch 300, loss 0.012509, change 0.002880
2020-10-03 20:08:08,588: <INFO> Epoch 350, loss 0.012487, change 0.000023
2020-10-03 20:08:19,198: <INFO> Epoch 400, loss 0.012479, change 0.000007
2020-10-03 20:08:29,837: <INFO> Epoch 450, loss 0.012477, change 0.000003
2020-10-03 20:08:32,005: <INFO> Training autoencoder v2: attempt 9
2020-10-03 20:08:32,005: <INFO> Model: "autoencoder-v2"
2020-10-03 20:08:32,006: <INFO> _________________________________________________________________
2020-10-03 20:08:32,006: <INFO> Layer (type)                 Output Shape              Param #   
2020-10-03 20:08:32,007: <INFO> =================================================================
2020-10-03 20:08:32,009: <INFO> conv1 (Conv2D)               (None, 32, 32, 4)         52        
2020-10-03 20:08:32,009: <INFO> _________________________________________________________________
2020-10-03 20:08:32,010: <INFO> conv2 (Conv2D)               (None, 16, 16, 13)        221       
2020-10-03 20:08:32,011: <INFO> _________________________________________________________________
2020-10-03 20:08:32,012: <INFO> deconv2 (Conv2DTranspose)    (None, 32, 32, 4)         212       
2020-10-03 20:08:32,012: <INFO> _________________________________________________________________
2020-10-03 20:08:32,014: <INFO> deconv1 (Conv2DTranspose)    (None, 64, 64, 3)         51        
2020-10-03 20:08:32,014: <INFO> =================================================================
2020-10-03 20:08:32,018: <INFO> Total params: 536
2020-10-03 20:08:32,019: <INFO> Trainable params: 433
2020-10-03 20:08:32,019: <INFO> Non-trainable params: 103
2020-10-03 20:08:32,020: <INFO> _________________________________________________________________
2020-10-03 20:08:33,001: <INFO> Epoch 0, loss 0.145234, change 0.145234
2020-10-03 20:08:43,482: <INFO> Epoch 50, loss 0.010007, change 0.135227
2020-10-03 20:08:53,857: <INFO> Epoch 100, loss 0.009921, change 0.000086
2020-10-03 20:09:04,494: <INFO> Epoch 150, loss 0.009825, change 0.000096
2020-10-03 20:09:15,014: <INFO> Epoch 200, loss 0.009758, change 0.000067
2020-10-03 20:09:25,549: <INFO> Epoch 250, loss 0.009729, change 0.000029
2020-10-03 20:09:36,111: <INFO> Epoch 300, loss 0.005782, change 0.003947
2020-10-03 20:09:46,615: <INFO> Epoch 350, loss 0.005759, change 0.000023
2020-10-03 20:09:56,999: <INFO> Epoch 400, loss 0.004270, change 0.001489
2020-10-03 20:10:07,350: <INFO> Epoch 450, loss 0.004248, change 0.000022
2020-10-03 20:10:17,698: <INFO> Epoch 500, loss 0.004247, change 0.000001
2020-10-03 20:10:19,891: <WARNING> From C:\Users\Teucros\AppData\Roaming\Python\Python37\site-packages\tensorflow\python\training\tracking\tracking.py:111: Model.state_updates (from tensorflow.python.keras.engine.training) is deprecated and will be removed in a future version.
Instructions for updating:
This property should not be used in TensorFlow 2.0, as updates are applied automatically.
2020-10-03 20:10:19,918: <WARNING> From C:\Users\Teucros\AppData\Roaming\Python\Python37\site-packages\tensorflow\python\training\tracking\tracking.py:111: Layer.updates (from tensorflow.python.keras.engine.base_layer) is deprecated and will be removed in a future version.
Instructions for updating:
This property should not be used in TensorFlow 2.0, as updates are applied automatically.
2020-10-03 20:10:21,225: <INFO> Assets written to: model\v2\assets
2020-10-03 20:10:21,327: <INFO> Best loss is 0.000070
2020-10-03 20:14:21,376: <INFO> max loss is 0.009569
